<a href="https://colab.research.google.com/github/salimunlu47/data-science-libraries/blob/main/Jose_Portilla_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [56]:
import numpy as np

In [57]:
import pandas as pd

In [58]:
#help(pd.Series)

In [59]:
myindex = ["USA","Canada","Mexico"]
mydata = [1776,1867,1821]
myser = pd.Series(data=mydata)
myser

0    1776
1    1867
2    1821
dtype: int64

In [60]:
type(myser)

pandas.core.series.Series

In [61]:
myser = pd.Series(data=mydata, index=myindex)
myser

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [62]:
myser[0]

1776

In [63]:
myser["USA"]

1776

In [64]:
myser = pd.Series(mydata, myindex)
myser

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [65]:
ages = {"Sam":5, "Frank":10, "Spike":7}

In [66]:
pd.Series(ages)

Sam       5
Frank    10
Spike     7
dtype: int64

In [67]:
q1 = {"Japan":80, "China":450, "India":200, "USA":250}
q2 = {"Brazil":100, "China":500, "India":210, "USA":260}

In [68]:
sales_q1 = pd.Series(q1)

In [69]:
sales_q2 = pd.Series(q2)

In [70]:
sales_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [71]:
sales_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [72]:
sales_q1["Japan"] #more readable

80

In [73]:
sales_q1[0]

80

In [74]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [75]:
[1,2] * 2

[1, 2, 1, 2]

In [76]:
np.array([1,2]) * 2

array([2, 4])

In [77]:
sales_q1 / 100

Japan    0.8
China    4.5
India    2.0
USA      2.5
dtype: float64

In [78]:
sales_q1 + sales_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [79]:
sales_q1.add(sales_q2, fill_value = 0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

# **DATA FRAMES**

In [80]:
np.random.seed(101)
mydata = np.random.randint(0,101,(4,3))

In [81]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [82]:
myindex = ["CA", "NY", "AZ", "TX"]

In [83]:
mycolumns = ["Jan", "Feb", "Mar"]

In [84]:
df = pd.DataFrame(data=mydata)
df

    0   1   2
0  95  11  81
1  70  63  87
2  75   9  77
3  40   4  63

In [85]:
df = pd.DataFrame(data=mydata, index=myindex, columns=mycolumns)

In [86]:
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int64
 1   Feb     4 non-null      int64
 2   Mar     4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [88]:
pwd

'/content'

In [89]:
#from google.colab import files
#uploaded = files.upload()

In [90]:
url = "https://raw.githubusercontent.com/salimunlu47/data-science-libraries/main/datasets/tips.csv"
df = pd.read_csv(url)

In [91]:
df.head()

   total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0       16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1       10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2       21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3       23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4       24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251

[5 rows x 11 columns]

In [92]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [93]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [94]:
df.tail(10)

     total_bill   tip     sex  ...       Payer Name         CC Number Payment ID
234       15.53  3.00    Male  ...    Tracy Douglas  4097938155941930    Sat7220
235       10.07  1.25    Male  ...    Sean Gonzalez  3534021246117605    Sat4615
236       12.60  1.00    Male  ...    Matthew Myers  3543676378973965    Sat5032
237       32.83  1.17    Male  ...     Thomas Brown  4284722681265508    Sat2929
238       35.83  4.67  Female  ...   Kimberly Crane      676184013727    Sat9777
239       29.03  5.92    Male  ...    Michael Avila  5296068606052842    Sat2657
240       27.18  2.00  Female  ...   Monica Sanders  3506806155565404    Sat1766
241       22.67  2.00    Male  ...       Keith Wong  6011891618747196    Sat3880
242       17.82  1.75    Male  ...     Dennis Dixon     4375220550950      Sat17
243       18.78  3.00  Female  ...  Michelle Hardin  3511451626698139    Thur672

[10 rows x 11 columns]

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [96]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

In [97]:
df.describe().transpose()

                  count          mean  ...           75%           max
total_bill        244.0  1.978594e+01  ...  2.412750e+01  5.081000e+01
tip               244.0  2.998279e+00  ...  3.562500e+00  1.000000e+01
size              244.0  2.569672e+00  ...  3.000000e+00  6.000000e+00
price_per_person  244.0  7.888197e+00  ...  9.390000e+00  2.027000e+01
CC Number         244.0  2.563496e+15  ...  4.553675e+15  6.596454e+15

[5 rows x 8 columns]

# Columns

In [98]:
df["total_bill"]

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [99]:
type(df["total_bill"]) #each column pandas series

pandas.core.series.Series

In [100]:
mycols = ["total_bill", "tip"]
df[mycols]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [101]:
df[["total_bill", "tip"]]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [102]:
df["tip"] + df["total_bill"]

0      18.00
1      12.00
2      24.51
3      26.99
4      28.20
       ...
239    34.95
240    29.18
241    24.67
242    19.57
243    21.78
Length: 244, dtype: float64

In [103]:
df["tip_percentage"] = 100 * df["tip"] / df["total_bill"]

In [104]:
df.head()

   total_bill   tip     sex  ...         CC Number Payment ID tip_percentage
0       16.99  1.01  Female  ...  3560325168603410    Sun2959       5.944673
1       10.34  1.66    Male  ...  4478071379779230    Sun4608      16.054159
2       21.01  3.50    Male  ...  6011812112971322    Sun4458      16.658734
3       23.68  3.31    Male  ...  4676137647685994    Sun5260      13.978041
4       24.59  3.61  Female  ...  4832732618637221    Sun2251      14.680765

[5 rows x 12 columns]

In [105]:
df["price_per_person"] = np.round(df["total_bill"] / df["size"],2)

In [106]:
df.head()

   total_bill   tip     sex  ...         CC Number Payment ID tip_percentage
0       16.99  1.01  Female  ...  3560325168603410    Sun2959       5.944673
1       10.34  1.66    Male  ...  4478071379779230    Sun4608      16.054159
2       21.01  3.50    Male  ...  6011812112971322    Sun4458      16.658734
3       23.68  3.31    Male  ...  4676137647685994    Sun5260      13.978041
4       24.59  3.61  Female  ...  4832732618637221    Sun2251      14.680765

[5 rows x 12 columns]

In [107]:
df.drop("tip_percentage", axis=1) #dropping column

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2         21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3         23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4         24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251
..          ...   ...     ...  ...                 ...               ...        ...
239       29.03  5.92    Male  ...       Michael Avila  5296068606052842    Sat2657
240       27.18  2.00  Female  ...      Monica Sanders  3506806155565404    Sat1766
241       22.67  2.00    Male  ...          Keith Wong  6011891618747196    Sat3880
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17
243       18.78  3.00  Female  ...     Michelle Hardin  3511451626698139    Thur672

[244 rows x 11 columns]

In [108]:
df = df.drop("tip_percentage", axis=1) #dropping column permenant

In [109]:
df.shape

(244, 11)

# Rows

In [110]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [111]:
df = df.set_index("Payment ID")

In [112]:
df.head()

            total_bill   tip  ...          Payer Name         CC Number
Payment ID                    ...
Sun2959          16.99  1.01  ...  Christy Cunningham  3560325168603410
Sun4608          10.34  1.66  ...      Douglas Tucker  4478071379779230
Sun4458          21.01  3.50  ...      Travis Walters  6011812112971322
Sun5260          23.68  3.31  ...    Nathaniel Harris  4676137647685994
Sun2251          24.59  3.61  ...        Tonya Carter  4832732618637221

[5 rows x 10 columns]

In [113]:
df = df.reset_index()

In [114]:
df.head()

  Payment ID  total_bill  ...          Payer Name         CC Number
0    Sun2959       16.99  ...  Christy Cunningham  3560325168603410
1    Sun4608       10.34  ...      Douglas Tucker  4478071379779230
2    Sun4458       21.01  ...      Travis Walters  6011812112971322
3    Sun5260       23.68  ...    Nathaniel Harris  4676137647685994
4    Sun2251       24.59  ...        Tonya Carter  4832732618637221

[5 rows x 11 columns]

In [115]:
df = df.set_index("Payment ID")

In [116]:
df.iloc[0]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [117]:
df.loc["Sun2959"]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [118]:
df.iloc[0:4] #slicing rows

            total_bill   tip  ...          Payer Name         CC Number
Payment ID                    ...
Sun2959          16.99  1.01  ...  Christy Cunningham  3560325168603410
Sun4608          10.34  1.66  ...      Douglas Tucker  4478071379779230
Sun4458          21.01  3.50  ...      Travis Walters  6011812112971322
Sun5260          23.68  3.31  ...    Nathaniel Harris  4676137647685994

[4 rows x 10 columns]

In [119]:
df.loc[["Sun2959","Sun5260"]]

            total_bill   tip  ...          Payer Name         CC Number
Payment ID                    ...
Sun2959          16.99  1.01  ...  Christy Cunningham  3560325168603410
Sun5260          23.68  3.31  ...    Nathaniel Harris  4676137647685994

[2 rows x 10 columns]

In [120]:
df = df.drop("Sun2959", axis=0) #first row dropped

In [121]:
df.head()

            total_bill   tip  ...        Payer Name         CC Number
Payment ID                    ...
Sun4608          10.34  1.66  ...    Douglas Tucker  4478071379779230
Sun4458          21.01  3.50  ...    Travis Walters  6011812112971322
Sun5260          23.68  3.31  ...  Nathaniel Harris  4676137647685994
Sun2251          24.59  3.61  ...      Tonya Carter  4832732618637221
Sun9679          25.29  4.71  ...        Erik Smith   213140353657882

[5 rows x 10 columns]

In [122]:
one_row = df.iloc[0]

In [123]:
one_row

total_bill                     10.34
tip                             1.66
sex                             Male
smoker                            No
day                              Sun
time                          Dinner
size                               3
price_per_person                3.45
Payer Name            Douglas Tucker
CC Number           4478071379779230
Name: Sun4608, dtype: object

In [124]:
df = df.append(one_row)

In [125]:
df

            total_bill   tip  ...        Payer Name         CC Number
Payment ID                    ...
Sun4608          10.34  1.66  ...    Douglas Tucker  4478071379779230
Sun4458          21.01  3.50  ...    Travis Walters  6011812112971322
Sun5260          23.68  3.31  ...  Nathaniel Harris  4676137647685994
Sun2251          24.59  3.61  ...      Tonya Carter  4832732618637221
Sun9679          25.29  4.71  ...        Erik Smith   213140353657882
...                ...   ...  ...               ...               ...
Sat1766          27.18  2.00  ...    Monica Sanders  3506806155565404
Sat3880          22.67  2.00  ...        Keith Wong  6011891618747196
Sat17            17.82  1.75  ...      Dennis Dixon     4375220550950
Thur672          18.78  3.00  ...   Michelle Hardin  3511451626698139
Sun4608          10.34  1.66  ...    Douglas Tucker  4478071379779230

[244 rows x 10 columns]

# CONDITIONAL FILTERING

In [126]:
url = "https://raw.githubusercontent.com/salimunlu47/data-science-libraries/main/datasets/tips.csv"
df = pd.read_csv(url)
df.head()

   total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0       16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1       10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2       21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3       23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4       24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251

[5 rows x 11 columns]

In [127]:
bool_series = df["total_bill"] > 40

In [128]:
df[bool_series]

     total_bill    tip     sex  ...       Payer Name         CC Number Payment ID
59        48.27   6.73    Male  ...      Brian Ortiz  6596453823950595    Sat8139
95        40.17   4.73    Male  ...    Aaron Bentley   180026611638690    Fri9628
102       44.30   2.50  Female  ...    Heather Cohen   379771118886604    Sat6240
142       41.19   5.00    Male  ...     Eric Andrews  4356531761046453   Thur3621
156       48.17   5.00    Male  ...    Ryan Gonzales  3523151482063321    Sun7518
170       50.81  10.00    Male  ...    Gregory Clark  5473850968388236    Sat1954
182       45.35   3.50    Male  ...     Jose Parsons  4112207559459910    Sun2337
184       40.55   3.00    Male  ...      Stephen Cox  3547798222044029    Sun5140
197       43.11   5.00  Female  ...      Brooke Soto  5544902205760175   Thur9313
212       48.33   9.00    Male  ...  Alex Williamson      676218815212    Sat4590

[10 rows x 11 columns]

In [129]:
df[df["sex"] == "Male"]

     total_bill   tip   sex  ...          Payer Name         CC Number Payment ID
1         10.34  1.66  Male  ...      Douglas Tucker  4478071379779230    Sun4608
2         21.01  3.50  Male  ...      Travis Walters  6011812112971322    Sun4458
3         23.68  3.31  Male  ...    Nathaniel Harris  4676137647685994    Sun5260
5         25.29  4.71  Male  ...          Erik Smith   213140353657882    Sun9679
6          8.77  2.00  Male  ...  Kristopher Johnson  2223727524230344    Sun5985
..          ...   ...   ...  ...                 ...               ...        ...
236       12.60  1.00  Male  ...       Matthew Myers  3543676378973965    Sat5032
237       32.83  1.17  Male  ...        Thomas Brown  4284722681265508    Sat2929
239       29.03  5.92  Male  ...       Michael Avila  5296068606052842    Sat2657
241       22.67  2.00  Male  ...          Keith Wong  6011891618747196    Sat3880
242       17.82  1.75  Male  ...        Dennis Dixon     4375220550950      Sat17

[157 rows x 11 columns]

In [130]:
df[(df["total_bill"] > 30) & (df["sex"] == "Male")]

     total_bill    tip  ...         CC Number Payment ID
23        39.42   7.58  ...  3542584061609808     Sat239
39        31.27   5.00  ...  6011525851069856    Sat6373
44        30.40   5.60  ...      503846761263    Sun2274
47        32.40   6.00  ...  3552002592874186    Sun9677
56        38.01   3.00  ...   349793629453226    Sat8903
59        48.27   6.73  ...  6596453823950595    Sat8139
83        32.68   5.00  ...  5356177501009133   Thur8801
95        40.17   4.73  ...   180026611638690    Fri9628
112       38.07   4.00  ...  3572865915176463     Sun591
141       34.30   6.70  ...  3526515703718508   Thur1025
142       41.19   5.00  ...  4356531761046453   Thur3621
156       48.17   5.00  ...  3523151482063321    Sun7518
167       31.71   4.50  ...  3566285921227119    Sun3719
170       50.81  10.00  ...  5473850968388236    Sat1954
173       31.85   3.18  ...  3577115550328507    Sun9335
175       32.90   3.11  ...   370307040837149    Sun5109
179       34.63   3.55  ...   346656312114848    Sun9851
180       34.65   3.68  ...      676168737648    Sun7544
182       45.35   3.50  ...  4112207559459910    Sun2337
184       40.55   3.00  ...  3547798222044029    Sun5140
187       30.46   2.00  ...  4792882899700988    Sun9987
207       38.73   3.00  ...   347817964484033    Sat4505
210       30.06   2.00  ...    30184049218122    Sat8361
212       48.33   9.00  ...      676218815212    Sat4590
237       32.83   1.17  ...  4284722681265508    Sat2929

[25 rows x 11 columns]

In [131]:
df[(df["total_bill"] > 50) | (df["sex"] == "Female")]

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
4         24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251
11        35.26  5.00  Female  ...        Diane Macias  4577817359320969    Sun6686
14        14.83  3.02  Female  ...       Vanessa Jones    30016702287574    Sun3848
16        10.33  1.67  Female  ...    Elizabeth Foster  4240025044626033    Sun9715
..          ...   ...     ...  ...                 ...               ...        ...
226       10.09  2.00  Female  ...          Ruth Weiss  5268689490381635    Fri6359
229       22.12  2.88  Female  ...    Jennifer Russell     4793003293608    Sat3943
238       35.83  4.67  Female  ...      Kimberly Crane      676184013727    Sat9777
240       27.18  2.00  Female  ...      Monica Sanders  3506806155565404    Sat1766
243       18.78  3.00  Female  ...     Michelle Hardin  3511451626698139    Thur672

[88 rows x 11 columns]

In [132]:
df[(df["day"] == "Sun") | (df["day"] == "Sat")]

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2         21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3         23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4         24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251
..          ...   ...     ...  ...                 ...               ...        ...
238       35.83  4.67  Female  ...      Kimberly Crane      676184013727    Sat9777
239       29.03  5.92    Male  ...       Michael Avila  5296068606052842    Sat2657
240       27.18  2.00  Female  ...      Monica Sanders  3506806155565404    Sat1766
241       22.67  2.00    Male  ...          Keith Wong  6011891618747196    Sat3880
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17

[163 rows x 11 columns]

In [133]:
options = ["Sat", "Sun"]

In [134]:
df[df["day"].isin(options)]

     total_bill   tip     sex  ...          Payer Name         CC Number Payment ID
0         16.99  1.01  Female  ...  Christy Cunningham  3560325168603410    Sun2959
1         10.34  1.66    Male  ...      Douglas Tucker  4478071379779230    Sun4608
2         21.01  3.50    Male  ...      Travis Walters  6011812112971322    Sun4458
3         23.68  3.31    Male  ...    Nathaniel Harris  4676137647685994    Sun5260
4         24.59  3.61  Female  ...        Tonya Carter  4832732618637221    Sun2251
..          ...   ...     ...  ...                 ...               ...        ...
238       35.83  4.67  Female  ...      Kimberly Crane      676184013727    Sat9777
239       29.03  5.92    Male  ...       Michael Avila  5296068606052842    Sat2657
240       27.18  2.00  Female  ...      Monica Sanders  3506806155565404    Sat1766
241       22.67  2.00    Male  ...          Keith Wong  6011891618747196    Sat3880
242       17.82  1.75    Male  ...        Dennis Dixon     4375220550950      Sat17

[163 rows x 11 columns]